## LeetCode ==> Second highest salary.

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'salary': [100, 100, 200, 300]
})

In [3]:
df

   id  salary
0   1     100
1   2     100
2   3     200
3   4     300

In [4]:
employee = df.salary.drop_duplicates().sort_values(ascending=False)

In [5]:
employee

3    300
2    200
0    100
Name: salary, dtype: int64

In [6]:
employee.iloc[2]

np.int64(100)

In [7]:
if len(employee) < 2:
    hv = None
else:
    hv = employee.iloc[1]

In [8]:
hv

np.int64(200)

### Department highest salary

In [9]:
employee_data = {
    'id': [1, 2, 3, 4, 5],
    'name': ['Joe', 'Jim', 'Henry', 'Sam', 'Max'],
    'salary': [70000, 90000, 80000, 60000, 90000],
    'departmentId': [1, 1, 2, 2, 1]
}

employee = pd.DataFrame(employee_data)

department_data = {
    'id': [1, 2],
    'name': ['IT', 'Sales']
}
department = pd.DataFrame(department_data)

In [10]:
employee

   id   name  salary  departmentId
0   1    Joe   70000             1
1   2    Jim   90000             1
2   3  Henry   80000             2
3   4    Sam   60000             2
4   5    Max   90000             1

In [11]:
employee.groupby("departmentId")["salary"].sum()

departmentId
1    250000
2    140000
Name: salary, dtype: int64

In [12]:
department

   id   name
0   1     IT
1   2  Sales

In [13]:
df = employee.merge(department,left_on="departmentId",right_on="id",suffixes=("_em","_de"))
df

   id_em name_em  salary  departmentId  id_de name_de
0      1     Joe   70000             1      1      IT
1      2     Jim   90000             1      1      IT
2      3   Henry   80000             2      2   Sales
3      4     Sam   60000             2      2   Sales
4      5     Max   90000             1      1      IT

In [14]:
max_salary = df.groupby("name_de")["salary"].agg(max)
max_salary.reset_index()

C:\Users\ShahriarHA\AppData\Local\Temp\ipykernel_6124\1307379054.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  max_salary = df.groupby("name_de")["salary"].agg(max)

  name_de  salary
0      IT   90000
1   Sales   80000

In [15]:
max_salary_re = max_salary.reset_index()
max_salary_re

  name_de  salary
0      IT   90000
1   Sales   80000

In [16]:
result = df.merge(max_salary_re,on=["name_de","salary"])
result

   id_em name_em  salary  departmentId  id_de name_de
0      2     Jim   90000             1      1      IT
1      3   Henry   80000             2      2   Sales
2      5     Max   90000             1      1      IT

In [17]:
result[["name_de","name_em","salary"]].set_axis(["Department","Employee","Salary"],axis=1)

  Department Employee  Salary
0         IT      Jim   90000
1      Sales    Henry   80000
2         IT      Max   90000

### Rank Scores

In [18]:
data = {
    'id': [1, 2, 3, 4, 5, 6],
    'score': [3.50, 3.65, 4.00, 3.85, 4.00, 3.65]
}
scores_df = pd.DataFrame(data)
scores_df

   id  score
0   1   3.50
1   2   3.65
2   3   4.00
3   4   3.85
4   5   4.00
5   6   3.65

In [19]:
sorted_scores_df = scores_df.sort_values(by="score",ascending=False)
sorted_scores_df

   id  score
4   5   4.00
2   3   4.00
3   4   3.85
1   2   3.65
5   6   3.65
0   1   3.50

In [23]:
sorted_scores_df["rank"] = sorted_scores_df.score.rank(method='dense',ascending=False)
sorted_scores_df

   id  score  rank
4   5   4.00   1.0
2   3   4.00   1.0
3   4   3.85   2.0
1   2   3.65   3.0
5   6   3.65   3.0
0   1   3.50   4.0

In [33]:
sorted_scores_df["rank"] = sorted_scores_df["rank"].astype(int)

In [34]:
sorted_scores_df

   id  score  rank
4   5   4.00     1
2   3   4.00     1
3   4   3.85     2
1   2   3.65     3
5   6   3.65     3
0   1   3.50     4

In [35]:
sorted_scores_df[["score","rank"]]

   score  rank
4   4.00     1
2   4.00     1
3   3.85     2
1   3.65     3
5   3.65     3
0   3.50     4

### Count Salary Ctegories

In [49]:
accounts = pd.DataFrame({
    'account_id': [3, 2, 8, 6],
    'income': [108939, 12747, 87709, 91796]
})
accounts

   account_id  income
0           3  108939
1           2   12747
2           8   87709
3           6   91796

In [45]:
# def count_category(x):
#     if x < 20000:
#         return 
#     # elif :
#     #     return "Average Salary"
#     # else:
#     #     return "High Salary"

In [50]:
# accounts["category"] = accounts.income.apply(select_category)
accounts["Low Salary"] = accounts.income.apply(lambda x: 1 if x < 20000 else 0)
accounts["Average Salary"] = accounts.income.apply(lambda x: 1 if (x >= 20000) and (x <= 50000) else 0)
accounts["High Salary"] = accounts.income.apply(lambda x: 1 if x > 50000 else 0)

In [51]:
accounts

   account_id  income  Low Salary  Average Salary  High Salary
0           3  108939           0               0            1
1           2   12747           1               0            0
2           8   87709           0               0            1
3           6   91796           0               0            1

In [52]:
melted_account = pd.melt(accounts,id_vars="income",value_vars=["Low Salary","Average Salary","High Salary"],var_name="category",value_name="accounts_count")

In [53]:
melted_account

    income        category  accounts_count
0   108939      Low Salary               0
1    12747      Low Salary               1
2    87709      Low Salary               0
3    91796      Low Salary               0
4   108939  Average Salary               0
5    12747  Average Salary               0
6    87709  Average Salary               0
7    91796  Average Salary               0
8   108939     High Salary               1
9    12747     High Salary               0
10   87709     High Salary               1
11   91796     High Salary               1

In [56]:
res = melted_account.groupby("category")["accounts_count"].agg(sum).reset_index()

C:\Users\ShahriarHA\AppData\Local\Temp\ipykernel_6124\4025551779.py:1: FutureWarning: The provided callable <built-in function sum> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  res = melted_account.groupby("category")["accounts_count"].agg(sum).reset_index()

In [57]:
res

         category  accounts_count
0  Average Salary               0
1     High Salary               3
2      Low Salary               1